// 4 блок (1)

//Point2D — struct, бо це легкі дані, які вигідно тримати в стеку для швидкого створення та видалення без навантаження на збирач сміття.
// Employee — class, бо це об'єкт (reference type), який необхідно передавати за посиланням, щоб зміни в ньому застосовувались у всіх частинах програми.
// Money — struct, бо нам важлива тільки сама сума і валюта (наприклад, 100 доларів — це завжди 100 доларів), а структури якраз автоматично порівнюють самі значення всередині, а не комірки пам'яті.


// 4 блок (2)

//Coordinates3D — struct
//якщо наприклад оберем class, то створення мільйонів класів переповнить "купу" (Heap), і Garbage Collector просто сильно загальмує програму, намагаючись їх видалити.

//SensorReading — record (або record struct)
//якщо наприклад оберем class, то звичайні класи порівнюються за місцем у пам'яті, тому доведеться вручну писати зайвий код (перевизначати метод Equals), щоб змусити їх правильно порівнюватися за самими показниками.

//MonitoringSession — class
//якщо наприклад оберем struct, то оскільки структури копіюються при передачі, буде випадково змінювати стан копії в іншому місці коду, а оригінальна сесія залишатиметься старою (дані будуть губитися).